chriskinal/QuailTracker/stm32/QuailTracker_U575/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32u5xx_hal.h"
#include <stdio.h>

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
#include "device_state.h"
/* Crash markers stashed in TAMP->BKP0R before a self-reset, read by
 * checkResetCause() on the next boot. */
#define CRASH_MAGIC_FAULT    0xFA017C0DUL   /* hard fault (BKP1..4 = CFSR/PC/HFSR/LR) */
#define CRASH_MAGIC_STACKOF  0x57AC0F10UL   /* FreeRTOS stack overflow / assert */
wake_source_t enterStop2(uint32_t seconds);
uint8_t sht30Read(void);   /* 1 = success; on 0, dev.env temp/hum are NOT valid */
void I2C_Recover(void);
void ADC_Recover(void);
void SPI2_Recover(void);
uint32_t rtcEpochNow(void);            /* RTC → UNIX epoch seconds; 0 if not synced */
void errLog(uint16_t code, uint32_t arg);  /* record an error occurrence (err_code_t) */
void errLogDump(void);                 /* append the error table + recent ring to diag.log */
void checkResetCause(void);            /* log why the last run ended (fault / warm reset) */
void rtcSyncFromGps(void);
void rtcGetTime(uint8_t *hours, uint8_t *minutes, uint8_t *seconds);
void rtcGetDate(uint8_t *day, uint8_t *month, uint16_t *year);
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SD_CS_Pin GPIO_PIN_4
#define SD_CS_GPIO_Port GPIOA
#define SD_CD_Pin GPIO_PIN_4
#define SD_CD_GPIO_Port GPIOC

/* USER CODE BEGIN Private defines */
#define FW_VERSION "0.10.31"
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
